---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArray.ForwardIterator
source: html/bf90b74b-1927-6af7-a6e4-17eb4fd5cd82.htm
---
# Autodesk.Revit.DB.ModelCurveArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ModelCurveArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.